passiveHeatTransfer2/passiveHeatTransfer2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inLet
    {
        type            patch;
        nFaces          20;
        startFace       4274;
    }
    outLet
    {
        type            patch;
        nFaces          20;
        startFace       4294;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          110;
        startFace       4314;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4400;
        startFace       4424;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          110;
        startFace       8824;
    }
    slave
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15;
        startFace       8934;
    }
)

// ************************************************************************* //
