passiveHeatTransfer2/passiveHeatTransfer2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.99;

boundaryField
{
    inLet
    {
        type            fixedValue;
        value           uniform 0.99;
    }
    outLet
    {
        type            zeroGradient;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.99;
    }
    
    slave
    {
        type            epsilonWallFunction;
        value           uniform 0.99;
    }
    sym 
    {
        type            symmetry;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
